<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"98fa616d49897daae5a1bfddf22e5ede98b1a47ceae55ff08e90545c9a372597","plan_job_ref":"Job Staging Image Build & Push #30 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7329848246","plan_hash":"b6c0fbec5b9f75839d1f33127dbac68e5a995724b504542569bc1f68267396bd","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster will be created
+   resource "aws_ecs_cluster" "fastapi-cluster" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "dev-fastapi-cluster"
+       tags_all = (known after apply)

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "aws_ecs_task_definition.task_definition_1.arn"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-0ac5d9e923d0871aa",
            ]
+           subnets          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #30](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7329848246)